Problem 1

Is gender independent of education level? A random sample of 395 people were
surveyed and each person was asked to report the highest education level they
obtained. The data that resulted from the survey is summarized in the following table:
High School Bachelors Masters Ph.d. Total
Female 60 54 46 41 201
Male 40 44 53 57 194
Total 100 98 99 98 395
Question: Are gender and education level dependent at 5% level of significance? In
other words, given the data collected above, is there a relationship between the
gender of an individual and the level of education that they have obtained?

In [1]:
import numpy as np
import pandas as pd
from scipy import stats

H0: The education and gender are independent

H1: The education and gender are dependent

In [2]:
#Let us re-create the dataframe from the question in the cell and add the aggregate sum across column and row

female_count= [60,54,46,41]
female_count.append(sum(female_count))
male_count= [40,44,53,57]
male_count.append(sum(male_count))
high_school= [60,40]
HS_total= sum(high_school)
Bachelors= [54,44]
Bac_total= sum(Bachelors)
Masters= [46,53]
Mas_total= sum(Masters)
PhD= [41,57]
Phd_total= sum(PhD)
gender= ['Female','Male','All']
we= HS_total+Bac_total+Mas_total+Phd_total
col_total= [HS_total, Bac_total, Mas_total, Phd_total,we]

In [3]:
female_count.insert(0, 'Female')

In [4]:
male_count.insert(0,'Male')

In [5]:
col_total.insert(0,'All')

In [6]:
lst= [female_count, male_count, col_total]

In [11]:
Table1= pd.DataFrame(lst, columns=['Gender','High_school','Bachelors','Masters', 'PhD', 'All'],index=None)

In [12]:
Table1

   Gender  High_school  Bachelors  Masters  PhD  All
0  Female           60         54       46   41  201
1    Male           40         44       53   57  194
2     All          100         98       99   98  395

In [15]:
Table2= Table1.iloc[0:2, 0:5]

In [16]:
Table2

   Gender  High_school  Bachelors  Masters  PhD
0  Female           60         54       46   41
1    Male           40         44       53   57

Table2 contains our observed frequency and now we have to find the expected frequency to do chi-sqaure test of indepedence

In [20]:
Table2_1= Table2.drop(['Gender'],axis=1)

In [21]:
Table2_1

   High_school  Bachelors  Masters  PhD
0           60         54       46   41
1           40         44       53   57

In [29]:
t3= np.outer(Table1['All'][0:2],Table1.iloc[2:3,1:5])/395.0

In [31]:
t3= pd.DataFrame(t3)
t3.columns= ['High_school','Bachelors','Masters','PhD']
t3.index= [0,1]

In [32]:
t3

   High_school  Bachelors    Masters        PhD
0    50.886076  49.868354  50.377215  49.868354
1    49.113924  48.131646  48.622785  48.131646

Table2_1 is our observed frequency and 

t3 is our observed frequency

In [43]:
#Calculating chi-square test

chi_sq_stat= (((Table2_1-t3)**2)/t3).sum()

In [44]:
chi_sq_stat

High_school    3.323588
Bachelors      0.696974
Masters        0.774385
PhD            3.211119
dtype: float64

In [45]:
final_chi_sq= sum(chi_sq_stat)

In [46]:
final_chi_sq

8.006066246262538

In [47]:
#At 5% level of significance and df= (no of row-1)(no of col-1)= (2-1)(4-1)=3

critical_val= stats.chi2.ppf(q=1-0.05, df=3)
print("The critical value is",critical_val)

The critical value is 7.814727903251179

In [52]:
print("The chi-square value {} is > critical value {} at 5% level of significance and hence we can reject the null hypothesis.Therefore we can conclude the problem by stating that education and gender are dependent".format(final_chi_sq,critical_val))

The chi-square value 8.006066246262538 is > critical value 7.814727903251179 at 5% level of significance and hence we can reject the null hypothesis.Therefore we can conclude the problem by stating that education and gender are dependent

Problem Statement 2:

Using the following data, perform a oneway analysis of variance using Î±=.05. Write
up the results in APA format.

[Group1: 51, 45, 33, 45, 67]
[Group2: 23, 43, 23, 43, 45]
[Group3: 56, 76, 74, 87, 56]

In [53]:
Group1= [51,45,33,45,67]
Group2= [23,43,23,43,45]
Group3= [56,76,74,87,56]

In [54]:
#one way ANOVA

statistic, pvalue= stats.f_oneway(Group1, Group2, Group3)

print("The f statistic value {} and pvalue {} ". format(statistic,pvalue))

The f statistic value 9.747205503009463 and pvalue 0.0030597541434430556

At alpha= 0.05 and p-value is less than 0.05 and we can infer that the sample means of 3 groups are different from one another

Problem Statement 3:

Calculate F Test for given 10, 20, 30, 40, 50 and 5,10,15, 20, 25.

For 10, 20, 30, 40, 50:

In [55]:
#The objective is to find f-test value which is defined as
# F= variance1/variance2

#To calculate variance:
# variance = (xi -x)^2/n-1


Grp1= [10,20,30,40,50]
Grp2= [5,10,15,20,25]
grp1_mean= np.mean(Grp1)
grp2_mean= np.mean(Grp2)

In [57]:
sum_grp1=[]
sum_grp2=[]

for i in Grp1:
    val= (i-grp1_mean)**2
    sum_grp1.append(val)
    
for j in Grp2:
    val= (j-grp2_mean)**2
    sum_grp2.append(val)

In [59]:
variance1= sum(sum_grp1)/len(Grp1)-1

variance2= sum(sum_grp2)/len(Grp2)-1

In [61]:
F= variance1/variance2

print("The F-test value is {}".format(F))

The F-test value is 4.061224489795919